
## Plan Result (prod)




<pre><code>Plan: 0 to add, 7 to change, 0 to destroy.</code></pre>

* Update
  * module.elastic.azurerm_network_security_rule.aks_rule
  * module.elastic.azurerm_network_security_rule.apps_rule
  * module.elastic.azurerm_network_security_rule.jenkins_rule
  * module.elastic.azurerm_network_security_rule.kibana_tight_kibana_rule[0]
  * module.elastic.azurerm_network_security_rule.kibana_tight_ssh_rule[0]
  * module.elastic.azurerm_resource_group.elastic-resourcegroup
  * module.elastic.module.elastic_action_group.azurerm_resource_group_template_deployment.action-group


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.elastic.data.azurerm_application_security_group.data_asg will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_application_security_group" "data_asg"  {
      ~ id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg" -> (known after apply)
      ~ location            = "uksouth" -> (known after apply)
        name                = "ccd-data-asg"
      ~ tags                = {
          - "provider" = "648D2193-0CE0-4EFB-8A82-AF9792184FD9"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.elastic.data.azurerm_application_security_group.kibana_asg[0] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_application_security_group" "kibana_asg"  {
      ~ id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-kibana-asg" -> (known after apply)
      ~ location            = "uksouth" -> (known after apply)
        name                = "ccd-kibana-asg"
      ~ tags                = {
          - "provider" = "648D2193-0CE0-4EFB-8A82-AF9792184FD9"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.elastic.data.azurerm_network_security_group.cluster_nsg will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_network_security_group" "cluster_nsg"  {
      ~ id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg" -> (known after apply)
      ~ location            = "uksouth" -> (known after apply)
        name                = "ccd-cluster-nsg"
      ~ security_rule       = [
          - {
              - access                                     = "Allow"
              - description                                = "Allows SSH traffic"
              - destination_address_prefix                 = ""
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = [
                  - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
                ]
              - destination_port_range                     = "22"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "SSH"
              - priority                                   = 100
              - protocol                                   = "TCP"
              - source_address_prefix                      = "VirtualNetwork"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = "Allows ElasticSeach communication only between nodes"
              - destination_address_prefix                 = ""
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = [
                  - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
                ]
              - destination_port_range                     = ""
              - destination_port_ranges                    = [
                  - "9200",
                  - "9300",
                ]
              - direction                                  = "Inbound"
              - name                                       = "ElasticClusterTransport"
              - priority                                   = 120
              - protocol                                   = "TCP"
              - source_address_prefix                      = ""
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = [
                  - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
                ]
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = "Allows ElasticSeach queries from the LoadBalancer.  Needed for LoadBalancer healthchecks."
              - destination_address_prefix                 = ""
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = [
                  - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
                ]
              - destination_port_range                     = ""
              - destination_port_ranges                    = [
                  - "9200",
                  - "9300",
                ]
              - direction                                  = "Inbound"
              - name                                       = "LB_To_ES"
              - priority                                   = 160
              - protocol                                   = "TCP"
              - source_address_prefix                      = "AzureLoadBalancer"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Deny"
              - description                                = "Deny all traffic that is not Elastic or SSH from anywhere"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "DenyAllOtherTraffic"
              - priority                                   = 300
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = "Allow Bastion SSH access overridding templates broad SSH access"
              - destination_address_prefix                 = "10.96.85.0/24"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "22"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "Bastion_To_VMs"
              - priority                                   = 230
              - protocol                                   = "Tcp"
              - source_address_prefix                      = ""
              - source_address_prefixes                    = [
                  - "10.11.8.37/32",
                  - "10.11.8.38/32",
                  - "172.16.0.5/32",
                ]
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = "Allow Apps to access the ElasticSearch cluster"
              - destination_address_prefix                 = ""
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = [
                  - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
                ]
              - destination_port_range                     = "9200"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "App_To_ES"
              - priority                                   = 210
              - protocol                                   = "Tcp"
              - source_address_prefix                      = ""
              - source_address_prefixes                    = [
                  - "10.96.76.0/22",
                ]
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = "Allow Jenkins to access the ElasticSearch cluster for testing"
              - destination_address_prefix                 = ""
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = [
                  - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
                ]
              - destination_port_range                     = "9200"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "Jenkins_To_ES"
              - priority                                   = 220
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "10.10.70.0/23"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = "Allow AKS to access the ElasticSearch cluster"
              - destination_address_prefix                 = ""
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = [
                  - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
                ]
              - destination_port_range                     = "9200"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AKS_To_ES"
              - priority                                   = 215
              - protocol                                   = "TCP"
              - source_address_prefix                      = ""
              - source_address_prefixes                    = [
                  - "10.13.0.0/20",
                  - "10.13.16.0/20",
                  - "10.90.64.0/20",
                  - "10.90.80.0/20",
                ]
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = ""
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = [
                  - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
                ]
              - destination_port_range                     = ""
              - destination_port_ranges                    = [
                  - "9200",
                  - "9300",
                ]
              - direction                                  = "Inbound"
              - name                                       = "Kibana_To_ES"
              - priority                                   = 140
              - protocol                                   = "TCP"
              - source_address_prefix                      = ""
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = [
                  - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-kibana-asg",
                ]
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
        ] -> (known after apply)
      ~ tags                = {
          - "provider" = "648D2193-0CE0-4EFB-8A82-AF9792184FD9"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.elastic.data.azurerm_network_security_group.kibana_nsg[0] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_network_security_group" "kibana_nsg"  {
      ~ id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/networkSecurityGroups/ccd-kibana-nsg" -> (known after apply)
      ~ location            = "uksouth" -> (known after apply)
        name                = "ccd-kibana-nsg"
      ~ security_rule       = [
          - {
              - access                                     = "Allow"
              - description                                = "Allows inbound SSH traffic from VirtualNetwork"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "22"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "SSH"
              - priority                                   = 100
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "VirtualNetwork"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = "Allows inbound Kibana HTTP traffic from VirtualNetwork"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "5601"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "Kibana"
              - priority                                   = 200
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "VirtualNetwork"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Deny"
              - description                                = "Deny all traffic that is not SSH or Kibana access"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "DenyAllOtherTraffic"
              - priority                                   = 400
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = "Override open Kibana accessand limit this to Bastion only"
              - destination_address_prefix                 = ""
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = [
                  - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-kibana-asg",
                ]
              - destination_port_range                     = "5601"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "Bastion_only_Kibana"
              - priority                                   = 310
              - protocol                                   = "Tcp"
              - source_address_prefix                      = ""
              - source_address_prefixes                    = [
                  - "10.11.8.37/32",
                  - "10.11.8.38/32",
                  - "172.16.0.5/32",
                ]
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = "Override open SSH and limit this to Bastion only"
              - destination_address_prefix                 = ""
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = [
                  - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-kibana-asg",
                ]
              - destination_port_range                     = "22"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "Bastion_only_SSH"
              - priority                                   = 300
              - protocol                                   = "Tcp"
              - source_address_prefix                      = ""
              - source_address_prefixes                    = [
                  - "10.11.8.37/32",
                  - "10.11.8.38/32",
                  - "172.16.0.5/32",
                ]
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
        ] -> (known after apply)
      ~ tags                = {
          - "provider" = "648D2193-0CE0-4EFB-8A82-AF9792184FD9"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.elastic.azurerm_network_security_rule.aks_rule will be updated in-place
  ~ resource "azurerm_network_security_rule" "aks_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/AKS_To_ES"
        name                                       = "AKS_To_ES"
        # (14 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.apps_rule will be updated in-place
  ~ resource "azurerm_network_security_rule" "apps_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/App_To_ES"
        name                                       = "App_To_ES"
        # (14 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.jenkins_rule will be updated in-place
  ~ resource "azurerm_network_security_rule" "jenkins_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/Jenkins_To_ES"
        name                                       = "Jenkins_To_ES"
        # (15 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.kibana_tight_kibana_rule[0] will be updated in-place
  ~ resource "azurerm_network_security_rule" "kibana_tight_kibana_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-kibana-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/networkSecurityGroups/ccd-kibana-nsg/securityRules/Bastion_only_Kibana"
        name                                       = "Bastion_only_Kibana"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.kibana_tight_ssh_rule[0] will be updated in-place
  ~ resource "azurerm_network_security_rule" "kibana_tight_ssh_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-kibana-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/networkSecurityGroups/ccd-kibana-nsg/securityRules/Bastion_only_SSH"
        name                                       = "Bastion_only_SSH"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_resource_group.elastic-resourcegroup will be updated in-place
  ~ resource "azurerm_resource_group" "elastic-resourcegroup" {
        id       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod"
        name     = "ccd-elastic-search-prod"
      ~ tags     = {
          - "application"         = "core-case-data"
          - "builtFrom"           = "https://github.com/HMCTS/ccd-elastic-search.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#ccd-community"
          - "environment"         = "production"
          - "lastUpdated"         = "2024-05-08T13:04:48Z"
          - "managedBy"           = "CCD"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.elastic.module.elastic_action_group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.Resources/deployments/es-ccd"
        name                     = "es-ccd"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged elements hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

Plan: 0 to add, 7 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.elastic.module.elastic_action_group.azurerm_resource_group_template_deployment.action-group has been changed
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.Resources/deployments/es-ccd"
        name                     = "es-ccd"
      + tags                     = {}
        # (7 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":67,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->